Revit 2024 API
ExportDWGSettings Class
 This element contains DWG/DXF export settings which are saved in a Revit document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ExportDWGSettings : Element
Visual Basic
Public Class ExportDWGSettings _
	Inherits Element
Visual C++
public ref class ExportDWGSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExportDWGSettings
See Also
ExportDWGSettings Members
Autodesk.Revit.DB Namespace